Pandas kutubxonasi buyicha kodlar ruyxati.ðŸ”¢ðŸ”¢ðŸ”¢_________________________________________________________________________________

In [ ]:
import pandas as pd
df=pd.read_csv("Titanic_Dataset.csv")
# df.head()    # boshidan 5 ta qatorni chiqaradi
# df.info()    # DataFrame haqida texnik malumot beruchi metod
# df.describe()  # raqamli ustunlar boâ€˜yicha statistik tahlil qiladi.
# df.describe(include="object")      # MATNLI ustunlar uchun ham ishlatish mumkin
# df.isnull().sum()    # har bir ustunda , nechta NaN borligini koâ€˜rsatadi. (isnull() - tekshiradi / sum() - qushib ketaveradi)
# df["survived"].value_counts()   # ustundagi qiymatlar nechta marta takrorlanganini sanaydi.
# df["survived"].value_counts(normalize=True)*100  # qiymatlarni foizda koâ€˜rsatadi.
# df["embarked"].value_counts
# df[df["age"]>70]  #  age ustuni 70 dan katta boâ€˜lgan qatorlarni ol
# df.columns  # dataframe dagi qatorlarni kursatadi
# df[  (df["age"]>70) & (df["sex"]=="male")  ]   # (& amali yordamida)30 dan katta erkaklar ni chiqarib beradi

# df[  (df["age"]>60) | (df["fare"]>200)  ]   # (| amali yordamida) Yoshi 60 dan katta yoki chipta narxi 200 dan yuqori
# df[df['survived'] == 1]  # Faqat tirik qolganlar
# df[(df['pclass'] == 1) & (df['survived'] == 1)]  #  1-klassdagilar va tirik qolganlar
# df.groupby('sex')['fare'].mean()  #  jinsi boâ€˜yicha oâ€˜rtacha chipta narxi
# df.groupby(["sex", "pclass"])["survived"].mean()
# df.sort_values("fare", ascending=False).head()  # Eng qimmat chipta kimlar?

# df[df["survived"]==1].sort_values("age", ascending=False).head()  # Eng katta yoshdagi tirik qolganlar
# df["age"].fillna(df["age"].mean(), inplace=True)  #  bosh qiymatlarni tuldirish
# df["age"].fillna(df["age"].mode()[0], inplace=True)  
# df.head()
# df.dropna(subset=["embarked"], inplace=True)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

df.head()____________________________________________________________________

In [9]:
import pandas as pd
data={
    "name":["Ali", "vali", "G'ani", "Aziza", "Malika"], 
    "age":[20, 22, 19, 21, 23],
    "gender": ["male", "male", "male", "female", "female"]
}
df=pd.DataFrame(data)
df.head(3)

    name  age gender
0    Ali   20   male
1   vali   22   male
2  G'ani   19   male

df.describe()_________________________________________________________________________________

In [2]:
import pandas as pd
data = {
    'age': [20, 22, 19, 21, 23],
    'fare': [10, 20, 15, 30, 25]
}
df=pd.DataFrame(data)
df.describe()

             age       fare
count   5.000000   5.000000
mean   21.000000  20.000000
std     1.581139   7.905694
min    19.000000  10.000000
25%    20.000000  15.000000
50%    21.000000  20.000000
75%    22.000000  25.000000
max    23.000000  30.000000

df.insull().sum()_________________________________________________________________________________

In [4]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gani', 'Aziza'],
    'age': [20, None, 19, None],
    'gender': ['male', 'male', None, 'female']
}
df=pd.DataFrame(data)
df.isnull().sum()

name      0
age       2
gender    1
dtype: int64

df["ustun_nomi"].value_counts()_________________________________________________________________________________

In [3]:
import pandas as pd

data = {
    'gender': ['male', 'female', 'male', 'male', 'female']
}
df=pd.DataFrame(data)
df["gender"].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

df[
    df["age"]>30
]_________________________________________________________________________________

In [33]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gulsima', 'Aziza'],
    'age': [20, 35, 40, 22],
    'gender': ['male', 'male', 'female', 'female']
}
df=pd.DataFrame(data)
df[df["age"]>30]
df[
    (df["age"]>30) & (df["gender"]=="male")
]

   name  age gender
1  Vali   35   male

df.groupby("ustun_nomi)["boshqa_ustun_nomi"].mean_________________________________________________________________________________

In [65]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gani', 'Aziza', 'Malika'],
    'gender': ['male', 'male', 'male', 'female', 'female'],
    'age': [20, 22, 19, 21, 23]
}

df= pd.DataFrame(data)

# df.groupby("gender")["age"].mean()
df.groupby(["gender"]).agg({"age":"count"})

        age
gender
female    2
male      3

In [85]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gani', 'Aziza'],
    'age': [20, 35, 40, 22]
    
}


df=pd.DataFrame(data)
# df.sort_values("age")
# df.sort_values("age", ascending=False)
df['fare'] = [50, 20, 51, 30]
df.sort_values(['fare', 'age'], ascending=[True, False])

    name  age  fare
1   Vali   35    20
3  Aziza   22    30
0    Ali   20    50
2   Gani   40    51

In [126]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gani'],
    'age': [20, None, 22]
}

df = pd.DataFrame(data)

# df["age"].fillna(df["age"].mean(), inplace=True)   # o'rta qiymat bilan to'ldirish
df["age"].fillna(5, inplace=True)
# df["name"].fillna("unknown", inplace=True)
df.head()

   name   age
0   Ali  20.0
1  Vali   5.0
2  Gani  22.0

In [12]:
import pandas as pd

data = {
    'name': ['Ali', 'Vali', 'Gani'],
    'age': [20, None, 22],
    'fare': [100, None, 200]
}

df = pd.DataFrame(data)
# df.dropna(subset=["age"])
df.dropna(inplace=True)

In [19]:
import pandas as pd
data = {
    'name': ['Ali', 'Vali', 'Gani', 'Aziza'],
    'age': [20, 35, 40, 22]
    
}
df=pd.DataFrame(data)

df["age_plus_5"]=df["age"]+5
df.head()

    name  age  age_plus_5
0    Ali   20          25
1   Vali   35          40
2   Gani   40          45
3  Aziza   22          27